namespace Task_05_04
{
    internal class Program
    {
        //Дан квадратный массив размерность n*n. Произведите анализ данной матрицы и выясните является ли данная матрица 
        //диагональной(все элементы вне главной диагонали равны нулю) Если матрица является диагональной, то вывести ее
        //повторно с цветовым выделением главной диагонали.Если нет, то вывеси
        //сообщение что матрица не является диагональной.
        static void Main(string[] args)
        {
            
        }
    }
}
